= Update Examples =

Mongrel has the following functions for updating zero or more documents:
 * `modify/2`
 * `replace/2`
 * `repsert/2`
 * `save/1`

==Replacing a Document==
The code (run in the shell) below shows how we can add a review for "Rarnaby Budge" by Charles Dikkens (with two "k"s). We get the book and then replace it with an updated book record containing a review.

<pre>
12> {ok,Conn}=mongo:connect(localhost).
{ok,{connection,{"localhost",27017},<0.70.0>,infinity}}
13> mongrel:do(safe, master, Conn, mongrel_books, fun() ->                      
13> Book = mongrel:find_one(#book{title= <<"Rarnaby Budge">>}),                 
13> mongrel:replace(Book, Book#book{reviews = [#review{comment= <<"The well known Dutch author surpasses himself!">>}]}) 
13> end).
{ok,[ok]}
</pre>

==Modifying Documents==
We inadvertently misspelled the title of Edmund Wells' magnus opus as "David Copperfield" with two "p"s. We use a regex to find the book and a '$set' modifier to correct its title.

<pre>
21> f().
ok                       
22> {ok,Conn}=mongo:connect(localhost).
{ok,{connection,{"localhost",27017},<0.90.0>,infinity}}
23> mongrel:do(safe, master, Conn, mongrel_books, fun() ->                      
23> mongrel:modify(#book{title={regex, <<"^david cop">>, <<"i">>}},{'$set', #book{title= <<"David Coperfield">>}})
23> end).
{ok,ok}
</pre>


If we invoke `book_database:get_all()` we can see the updated list of books

<pre>
14> book_database:get_all().
{ok,[#book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,2>>},
         title = 
             <<"Thirty Days in the Samarkind Desert with the Duchess of Kent">>, 
         isbn = undefined,
         author = 
             #author{
                 '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,1>>},
                 first_name = undefined,last_name = <<"Eliott">>},
         reviews = undefined},
     #book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,3>>},
         title = <<"A Hundred and One Ways to start a Fight">>,
         isbn = undefined,author = undefined,
         reviews = 
             [#review{
                  star_rating = 5,
                  comment = 
                      <<"By an Irish gentleman whose name eludes me">>}]},
     #book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,5>>},
         title = <<"David Copperfield">>,isbn = undefined,
         author = 
             #author{
                 '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,4>>},
                 first_name = <<"Edmund">>,last_name = <<"Wells">>},
         reviews = undefined},
     #book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,6>>},
         title = <<"Grate Expectations">>,isbn = undefined,
         author = 
             #author{
                 '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,4>>},
                 first_name = <<"Edmund">>,last_name = <<"Wells">>},
         reviews = undefined},
     #book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,9>>},
         title = <<"Olsen's Standard Book of British Birds">>,
         isbn = undefined,author = undefined,
         reviews = 
             [#review{
                  star_rating = undefined,
                  comment = <<"Warning: Not the expurgated version.">>},
              #review{
                  star_rating = 2,
                  comment = <<"Might be interesting to bird-watchers.">>}]},
     #book{
         '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,8>>},
         title = <<"Rarnaby Budge">>,isbn = undefined,
         author = 
             #author{
                 '_id' = {<<79,98,59,46,138,250,150,12,57,0,0,7>>},
                 first_name = <<"Charles">>,last_name = <<"Dikkens">>},
         reviews = 
             [#review{
                  star_rating = undefined,
                  comment = 
                      <<"The well known Dutch author surpasses himsel"...>>}]}]} 
</pre>